[
  {
    "id": 1,
    "title": "WhatsApp",
    "companyName": "Meta",
    "image": "https://i.ibb.co.com/ycJFT7cJ/31dea8d4-d542-4d01-9a22-e7b2ff556b7f.jpg",
    "description": "WhatsApp is a popular messaging application used worldwide. You can send text messages, images, videos, and voice notes instantly. It also allows voice and video calls with friends and family. All chats are end-to-end encrypted, ensuring privacy. WhatsApp supports group chats, file sharing, and status updates. You can use it on both mobile devices and desktops. The app regularly updates with new features like stickers, dark mode, and animated emojis. It also integrates with other Meta services for seamless communication.",
    "size": 35,
    "reviews": "52M",
    "ratingAvg": 4.7,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "id": 2,
    "title": "Instagram",
    "companyName": "Meta",
    "image": "https://i.ibb.co.com/4nynNrcb/aa0c0691-1e84-4ec1-9359-5b9dcf601f92.jpg",
    "description": "Instagram is a widely used social media platform that focuses on sharing photos and videos. You can create posts, stories, and reels to connect with followers. It provides filters and editing tools to enhance your photos and videos. Users can explore trending content, follow creators, and engage through comments and likes. The platform offers direct messaging for private conversations. Instagram also supports live streaming and IGTV for long-form video content. Businesses can create profiles to promote products and analyze insights. The app is available on both Android and iOS devices.",
    "size": 45,
    "reviews": "51M",
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1800000 },
      { "name": "4 star", "count": 7500000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "id": 3,
    "title": "Facebook",
    "companyName": "Meta",
    "image": "https://i.ibb.co.com/QvV9TsXv/0f2b638e-09d5-42f0-8bbd-ac14c505afca.jpg",
    "description": "Facebook lets you connect with friends, join communities, share posts, photos, and videos. Stay up-to-date with news and events around the world. You can join groups based on interests, follow pages, and interact with content. Facebook Messenger allows chatting, voice, and video calls. It also supports stories, live streaming, and marketplace for buying and selling. Privacy settings let you control who sees your posts. The app provides notifications for activities and events. It integrates with Meta services for seamless social experience.",
    "size": 60,
    "reviews": "43M",
    "ratingAvg": 4.5,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7500000 },
      { "name": "5 star", "count": 9500000 }
    ]
  },
  {
    "id": 4,
    "title": "TikTok",
    "companyName": "ByteDance",
    "image": "https://i.ibb.co.com/9mtmZZQq/8bd58914-d05b-46ac-9fa5-d910de0d8022.jpg",
    "description": "TikTok is a leading short-video platform where users can create, watch, and share videos. Explore trending challenges, music clips, and viral content. The app offers editing tools, effects, and filters for creative videos. You can follow creators, like, comment, and share videos. TikTok supports live streaming and interaction with fans. It personalizes your feed using an AI-driven algorithm. The app is available on mobile devices worldwide. It is used for entertainment, education, and marketing. Regular updates add new features and trends for users to explore.",
    "size": 50,
    "reviews": "5M",
    "ratingAvg": 4.6,
    "downloads": 3000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 9500000 }
    ]
  },
  {
    "id": 5,
    "title": "YouTube",
    "companyName": "Google",
    "image": "https://i.ibb.co.com/kgrJkX5w/462c72dd-805c-418f-b92b-6a70b24d3396.jpg",
    "description": "YouTube is the world's largest video-sharing platform, allowing users to watch, upload, and share videos. It offers music, movies, tutorials, and live streams. Users can subscribe to channels to get updates on new content. YouTube provides playlists, offline viewing, and personalized recommendations. Creators can monetize content with ads and memberships. The platform supports comments, community posts, and live chats. Available on mobile, desktop, and smart TVs, it ensures seamless entertainment. YouTube Studio allows creators to track analytics and engage with audiences effectively.",
    "size": 55,
    "reviews": "2M",
    "ratingAvg": 4.8,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 8500000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "id": 6,
    "title": "Snapchat",
    "companyName": "Snap Inc",
    "image": "https://i.ibb.co.com/yTD15Pg/77da8b33-35d0-40b7-adfc-6e37acf3d6df.jpg",
    "description": "Snapchat is a multimedia messaging app for sending temporary photos and videos. Users can create stories visible to friends or the public. The app offers filters, lenses, and AR effects for creative expression. Snap Map allows sharing your location and exploring nearby events. Chat and voice/video calls enable private communication. Snapchat also supports Discover, showcasing news and entertainment content. Regular updates include new games, stickers, and augmented reality features. It is widely popular among teens and young adults. The app ensures privacy with temporary content and notification alerts.",
    "size": 40,
    "reviews": "32M",
    "ratingAvg": 4.4,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "id": 7,
    "title": "Spotify",
    "companyName": "Spotify Ltd",
    "image": "https://i.ibb.co.com/JW7xQLCG/98ddee6d-c0de-4f61-a4cd-c2aaad0f8f2e.jpg",
    "description": "Spotify is a music streaming service that provides millions of songs and podcasts. Users can create playlists, follow artists, and discover new music. It offers offline listening, personalized recommendations, and curated playlists. Podcasts cover news, entertainment, education, and lifestyle. Spotify Free and Premium plans cater to different user needs. Social sharing allows sharing songs with friends. Cross-device syncing enables seamless listening. The app regularly updates with new features and music releases. Artists can use Spotify for promoting and monetizing content worldwide.",
    "size": 45,
    "reviews": "52K",
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "id": 8,
    "title": "Gmail",
    "companyName": "Google",
    "image": "https://i.ibb.co.com/9m92cfSH/5b8966e7-1e01-4110-a8ad-fd73cfe5190d.jpg",
    "description": "Gmail is a free email service offering fast and secure communication. Users can send and receive emails, attach files, and organize messages into folders. The platform supports labels, filters, and priority inbox for effective management. It integrates with Google Drive, Calendar, and Meet for productivity. Smart compose and spam protection enhance user experience. Gmail is available on mobile and desktop platforms. Multiple account support allows easy switching. Offline mode ensures access without internet connectivity. Notifications keep users updated on new emails instantly.",
    "size": 30,
    "reviews": "6M",
    "ratingAvg": 4.6,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "id": 9,
    "title": "Twitter",
    "companyName": "X Corp",
    "image": "https://i.ibb.co.com/5hb9dp5Z/629dbce6-a89f-42bf-9aff-f838b43f103b.jpg",
    "description": "Twitter is a social networking platform that allows users to post tweets, follow topics, and engage with communities. It provides real-time news, trends, and updates globally. Users can like, retweet, and reply to tweets. Verified accounts indicate authenticity. Twitter Spaces enables live audio conversations. Direct messaging allows private communication. Users can create lists to organize followed accounts. Hashtags help discover trending discussions. It is available on mobile and web platforms, used for personal, professional, and business purposes.",
    "size": 35,
    "reviews": "2M",
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "id": 10,
    "title": "Netflix",
    "companyName": "Netflix Inc",
    "image": "https://i.ibb.co.com/YFCLCfQ9/8128948b-db8a-44cc-9eaf-8ce6ed3e4d5a.jpg",
    "description": "Netflix is a subscription-based streaming platform offering movies, TV shows, and documentaries. Users can watch content anywhere on multiple devices. The app allows creating profiles and personalized watchlists. Recommendations are based on viewing history. Netflix Originals provide exclusive series and films. Offline download feature allows watching without internet. Parental controls help manage children's viewing. High-definition streaming ensures quality experience. Regular updates add new content and features to enhance user engagement.",
    "size": 60,
    "reviews": "85K",
    "ratingAvg": 4.7,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 5000000 }
    ]
  },
  {
    "id": 11,
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "image": "https://i.ibb.co.com/pvSjMswJ/9713f81f-a669-4002-8020-2b8ee94926e5.jpg",
    "description": "Zoom is a video conferencing app that allows users to host and join online meetings. It supports video, audio, and screen sharing for collaboration. Users can chat privately or in group channels. The app provides virtual backgrounds and recording features. Zoom is used for business, education, and personal communication. Breakout rooms allow for small group discussions. Integration with calendars makes scheduling easy. Security features include password protection and waiting rooms. Available on desktop, mobile, and web platforms, it ensures global connectivity.",
    "size": 70,
    "reviews": "80K",
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "id": 12,
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "image": "https://i.ibb.co.com/zhwny1xs/5313c8cb-f84c-422e-a506-60c04a348c54.jpg",
    "description": "LinkedIn is a professional networking platform where users can connect with colleagues, find jobs, and share industry insights. You can create a professional profile, post updates, and engage with content. Companies post job openings and promote their brand. LinkedIn Learning offers courses to enhance skills. Messaging allows networking with peers. Users can join groups to discuss topics of interest. The platform provides analytics on profile and post performance. Available on mobile and web, it supports career growth. It helps professionals stay updated with industry news.",
    "size": 50,
    "reviews": "25K",
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "id": 13,
    "title": "Pinterest",
    "companyName": "Pinterest Inc",
    "image": "https://i.ibb.co.com/8LmSY0HH/8c8806ee-2cfa-4d07-b0ae-226fa8005d5a.jpg",
    "description": "Pinterest is a visual discovery platform where users can explore ideas and inspiration. Create boards to organize images and ideas. Users can follow topics, brands, or other creators. The platform supports shopping and product discovery. Pinterest provides recommendations based on user interests. You can save, share, and comment on pins. Mobile and web apps allow browsing on the go. Content includes recipes, home decor, fashion, and travel. It is widely used by individuals and businesses for inspiration and marketing.",
    "size": 40,
    "reviews": "35K",
    "ratingAvg": 4.5,
    "downloads": 400000000,
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "id": 14,
    "title": "Reddit",
    "companyName": "Reddit Inc",
    "image": "https://i.ibb.co.com/6JTjRy9H/2f9d98e7-108a-4b29-982b-50f410338826.jpg",
    "description": "Reddit is a social platform where users can post content, comment, and vote on discussions. Communities called subreddits cover various topics. Users can join groups of interest and share text, images, or links. Reddit allows AMAs (Ask Me Anything) for interaction with personalities. Upvotes and downvotes help highlight popular content. Moderators manage community rules. Reddit supports live discussions and chat features. Available on mobile and web, it has a vast user base worldwide. Users can explore news, entertainment, and niche communities.",
    "size": 35,
    "reviews": "45K",
    "ratingAvg": 4.3,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 90000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "id": 15,
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "image": "https://i.ibb.co.com/HfFBw45M/31d31778-bba1-4e7d-801f-25b6a163a4e1.jpg",
    "description": "Telegram is a cloud-based messaging app focusing on speed and security. Users can send messages, images, videos, and files of any type. It offers group chats, channels, and bots for automation. End-to-end encryption is available in secret chats. The app supports voice calls and video calls. Users can schedule messages and use stickers or GIFs. Telegram has a desktop and web version for multi-device usage. Large communities can communicate efficiently through channels. Regular updates improve privacy and add new features.",
    "size": 50,
    "reviews": "55K",
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 2250000 }
    ]
  },
  {
    "id": 16,
    "title": "Google Maps",
    "companyName": "Google",
    "image": "https://i.ibb.co.com/qYmKGP5Q/77d79744-e9b0-474e-8f0d-1e34a3cf5dcc.jpg",
    "description": "Google Maps is a navigation app that provides directions, traffic updates, and local business information. Users can explore streets with Street View and satellite imagery. The app supports walking, driving, cycling, and public transportation routes. Real-time traffic conditions help avoid congestion. Users can discover restaurants, stores, and attractions. Reviews and ratings assist in decision making. Offline maps are available for areas without internet. Integration with Google services improves search experience. Regular updates provide new features and data accuracy.",
    "size": 60,
    "reviews": "95K",
    "ratingAvg": 4.7,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 3100000 }
    ]
  },
  {
    "id": 17,
    "title": "Amazon",
    "companyName": "Amazon Inc",
    "image": "https://i.ibb.co.com/mr0P5kPf/c17ca466-ac75-44d4-9d7a-529b3f05efcd.jpg",
    "description": "Amazon is a global e-commerce platform offering millions of products. Users can browse categories, compare prices, and read reviews. Prime membership provides fast delivery, video streaming, and exclusive deals. The app supports wishlists, orders tracking, and secure payment options. Sellers can manage their stores efficiently. Recommendations are personalized based on browsing history. Amazon also provides grocery and cloud services. Available worldwide on mobile and web. Regular updates improve shopping experience and add new features.",
    "size": 70,
    "reviews": "75K",
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "id": 18,
    "title": "Uber",
    "companyName": "Uber Technologies",
    "image": "https://i.ibb.co.com/jPMh68fx/0d1ab30c-6aa0-46e8-bb15-038e3c31ff4f.jpg",
    "description": "Uber is a ride-hailing app that connects passengers with drivers. Users can request rides, choose vehicle types, and track drivers in real-time. The app provides fare estimates and payment options. Ratings and feedback improve driver and passenger experience. Uber Eats allows food delivery from local restaurants. Safety features include sharing trip details with contacts. The platform supports scheduling rides in advance. Drivers can manage earnings and trips. Available in multiple countries with multilingual support and regular updates.",
    "size": 60,
    "reviews": "72K",
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 2250000 }
    ]
  },
  {
    "id": 19,
    "title": "Airbnb",
    "companyName": "Airbnb Inc",
    "image": "https://i.ibb.co.com/bj4KJPxH/413867f6-2f68-4782-a7ca-ab54faeca5b2.jpg",
    "description": "Airbnb is a platform for booking lodging, vacation rentals, and experiences worldwide. Users can find homes, apartments, and unique stays. Hosts can list properties, manage bookings, and communicate with guests. The app supports reviews, ratings, and secure payments. Airbnb Experiences allow booking local activities. Search filters include location, price, amenities, and more. Safety and verification ensure secure stays. Travel guides provide recommendations and tips. Available on mobile and web, Airbnb simplifies travel planning globally.",
    "size": 55,
    "reviews": "45K",
    "ratingAvg": 4.6,
    "downloads": 300000000,
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2200000 }
    ]
  },
  {
    "id": 20,
    "title": "Slack",
    "companyName": "Slack Technologies",
    "image": "https://i.ibb.co.com/DD87pZr0/3b2146f5-55a2-45b0-b425-bdaa29053f95.jpg",
    "description": "Slack is a business communication platform for messaging, tools, and files. Users can create channels, direct messages, and threads for organized communication. Integration with third-party apps enhances workflows. Slack offers notifications, search, and file sharing. Video and voice calls are supported. Users can automate workflows using bots and apps. Available on desktop, web, and mobile. Regular updates improve usability, security, and collaboration features. Slack is widely used by teams of all sizes. It helps increase productivity and streamline communication.",
    "size": 60,
    "reviews": "65K",
    "ratingAvg": 4.4,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "id": 21,
    "title": "Dropbox",
    "companyName": "Dropbox Inc",
    "image": "https://i.ibb.co.com/3yCScKWS/18841594-0afa-44e2-beb5-522e42989b42.jpg",
    "description": "Dropbox is a cloud storage service to save files, photos, and documents securely. Users can access their files from any device and share them with others. The platform supports collaboration, file versioning, and offline access. Integration with apps like Microsoft Office improves productivity. Notifications and syncing ensure files are up-to-date. Available on mobile, desktop, and web. Regular updates enhance security and add new features. Dropbox helps teams and individuals manage files efficiently. Business plans provide advanced tools and analytics. It is widely used for personal and professional purposes.",
    "size": 55,
    "reviews": "85K",
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "id": 22,
    "title": "Outlook",
    "companyName": "Microsoft",
    "image": "https://i.ibb.co.com/BHyvJCh2/467eff4e-f4f1-4af2-9cac-f7af054c16f7.jpg",
    "description": "Microsoft Outlook is an email and calendar management app. Users can send and receive emails, schedule meetings, and organize tasks. Integration with Microsoft Office suite allows attachment editing and collaboration. Outlook provides notifications, rules, and focused inbox for productivity. Available on desktop, web, and mobile. Supports multiple accounts and offline access. Security features include encryption and spam filtering. Regular updates add new tools and enhance user experience. Outlook is widely used by professionals and organizations. It helps manage communication efficiently.",
    "size": 50,
    "reviews": "89K",
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 1250000 }
    ]
  },
  {
    "id": 23,
    "title": "TikTok Lite",
    "companyName": "ByteDance",
    "image": "https://i.ibb.co.com/GvjLmst6/4ffc4d8e-e17b-44be-9fff-2707ddc8c3be.jpg",
    "description": "TikTok Lite is a lightweight version of TikTok for faster performance on low-end devices. Users can watch, create, and share short videos. The app provides editing tools, effects, and filters for creative videos. Explore trending content and follow creators. TikTok Lite supports likes, comments, and sharing videos. Personalizes your feed using a smart algorithm. Available worldwide on Android. Uses less storage and data compared to the main app. Regular updates bring new features and improve stability. It is suitable for users seeking TikTok experience on smaller devices.",
    "size": 25,
    "reviews": "15K",
    "ratingAvg": 4.5,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 950000 }
    ]
  },
  {
    "id": 24,
    "title": "Duolingo",
    "companyName": "Duolingo Inc",
    "image": "https://i.ibb.co.com/b80GvhY/9dc83289-51c9-44a3-ac28-8b28d4123b95.jpg",
    "description": "Duolingo is a language-learning app for multiple languages. Users can learn through gamified lessons, quizzes, and exercises. It offers speaking, listening, reading, and writing practice. Progress tracking and daily streaks motivate consistent learning. The app includes challenges, leaderboards, and interactive exercises. Available on mobile and web platforms. Supports offline mode for lessons without internet. Regular updates add new courses and features. Duolingo helps learners improve vocabulary and grammar effectively. Suitable for beginners and intermediate learners worldwide.",
    "size": 35,
    "reviews": "75K",
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 1500000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "id": 25,
    "title": "Canva",
    "companyName": "Canva Pty Ltd",
    "image": "https://i.ibb.co.com/qLhCYzS5/738ae23b-bcd6-47bd-81cc-700b4bfa1078.jpg",
    "description": "Canva is a graphic design platform for creating presentations, social media graphics, and documents. Users can use templates, images, and fonts to design easily. Drag-and-drop interface simplifies design tasks. Canva supports collaboration with team members. Users can export designs in multiple formats. Available on web, desktop, and mobile. Regular updates add new templates, graphics, and features. Canva is used by individuals, businesses, and educators. It provides design tools for professionals and beginners. Free and premium plans cater to different needs.",
    "size": 45,
    "reviews": "60K",
    "ratingAvg": 4.6,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 3500000 }
    ]
  },
  {
    "id": 26,
    "title": "Google Photos",
    "companyName": "Google",
    "image": "https://i.ibb.co.com/9j6P9Bk/d816cd0d-0dae-48f0-9f8e-87812ddc3492.jpg",
    "description": "Google Photos is a photo and video storage app with cloud backup. Users can organize, edit, and share photos and albums. The app provides automatic backup, facial recognition, and search functionality. Users can create animations, collages, and movies from their photos. Integration with Google Drive and other apps enhances convenience. Available on mobile and web. Supports offline access and photo recovery. Regular updates improve features and storage efficiency. Google Photos ensures secure and easy access to memories anytime. It is widely used for personal and professional photo management.",
    "size": 50,
    "reviews": "50K",
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 250000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 3000000 }
    ]
  }
]